## Plan Result (sbox-managed-identity)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.log_analytics_role_aks_sp




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.log_analytics_role_aks_sp must be replaced
-/+ resource "azurerm_role_assignment" "log_analytics_role_aks_sp" {
      ~ id                               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox/providers/Microsoft.Authorization/roleAssignments/d5dcabbf-ef0b-7380-6d4b-33340ea5315e" -> (known after apply)
      ~ name                             = "d5dcabbf-ef0b-7380-6d4b-33340ea5315e" -> (known after apply)
      ~ principal_id                     = (sensitive value) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/92aaf0da-9dab-42b6-94a3-d43ce8d16293" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":457,"Program":"tfcmt","SHA1":"","Target":"sbox-managed-identity","Vars":{}} -->